#Created by JInto - www.guh-software.de
#Wed Sep 16 17:39:36 BRT 2009
DATE_FORMAT_KEY=dd/MM/yyyy
jcompany.componente.vinculado.label.popup=...
ajuda.data.ddmm=Informe d\u00EDa y mes en el formato "dd/mm/"
ajuda.data.ddmmaa=Informe fecha en el formato "dd/mm/aa"
ajuda.data.ddmmaaaa=Informe fecha en el formato "dd/mm/aaaaa"
ajuda.data.mmaa=Informe mes y a\u00F1o en el formato "mm/aa"
ajuda.data.mmaaaa=Informe mes y a\u00F1o en el formato "mm/aaaaa"
ajuda.datahora.ddmmaaaa=hh\:mm\=Informe fecha y hora en el formato "dd/mm/aaaa hh\:mm"
ajuda.nome.completo=Informe nombre completo
errors.byte={0} debe ser del tipo byte.
errors.creditcard={0} no es un n\u00FAmero v\u00E1lido de Tarjeta de Cr\u00E9dito.
errors.date={0} no es una fecha v\u00E1lida.
errors.double={0} debe ser un n\u00FAmero de punto flotante.
errors.email={0} no es una direcci\u00F3n v\u00E1lida de e-mail.
errors.extends=Validator 'extends' error for {0} - check log messages for details 
errors.float={0} debe ser un n\u00FAmero de punto flotante.
errors.integer={0} debe contener solo n\u00FAmeros.
errors.invalid={0} es inv\u00E1lido(a).
errors.long={0} debe contener solo n\u00FAmeros.
errors.maxlength={0} no puede tener m\u00E1s que {1} caracter(es).
errors.minlength={0} no puede tener menos que {1} caracter(es).
errors.range={0} debe estar en el rango de {1} a {2}.
errors.required={0} es obligatorio(a).
errors.short={0} debe ser del tipo short.
label.versao=Versión
temaExterno.titulo=Tema Externos 
esquema.titulo=Esquema DDL - Generación
jcompany.titulo.dados.esquema=Datos sobre el suministro para el esquema de generación
jcompany.esquema.acao.gerar.arquivo=Generar a Archivo ->
jcompany.esquema.obj.constraint=Restricciones
jcompany.esquema.obj.dados=Datos
jcompany.esquema.obj.indice=Índices
jcompany.esquema.obj.sequence=Secuencias
jcompany.esquema.obj.tabela=Tablas
jcompany.esquema.tipo.create=Creación
jcompany.esquema.tipo.drop=Exclusión
jcompany.esquema.tipo.update=Actualización
jcompany.evt.gerar.esquema=Generar Esquemas
jcompany.evt.executar.esquema=Escuchar Esquemas
jcompany.ajuda.arquivo.id=Identificador del Archivo Adjuntado.
jcompany.ajuda.arquivo.nome=Nombre del archivo adjuntado, como estaba en el momento del upload.
jcompany.ajuda.codigo=Informe un n\u00FAmero \u00FAnico para ser identificador de cada registro
jcompany.ajuda.data.ddmmaa=Informe una fecha en el formato dd/mm/aa
jcompany.ajuda.data.ddmmaaaa=Informe una fecha en el formato dd/mm/aaaa
jcompany.ajuda.data.mmaa=Informe mes y a\u00F1o  en el formato mm/aa
jcompany.ajuda.data.mmaaaa=Informe mes y a\u00F1o en el formato mm/aaaa
jcompany.ajuda.evt.desconectar=Desconecta la aplicaci\u00F3n
jcompany.ajuda.evt.portlet.baixo=Pasa este componente para bajo.
jcompany.ajuda.evt.portlet.cima=Pasa este componente para arriba.
jcompany.ajuda.evt.portlet.edita=Permite personalizar las informaciones de este componente.
jcompany.ajuda.evt.portlet.maximiza=Maximiza la visualizaci\u00F3n de este componente.
jcompany.ajuda.evt.portlet.retira=Retira definitivamente este componente de la p\u00E1gina.
jcompany.ajuda.exc=Haga click para marcar para exclusi\u00F3n
jcompany.ajuda.id=Informe un n\u00FAmero \u00FAnico para ser identificador de cada registro
jcompany.ajuda.nome.completo=Informe su nombre completo
jcompany.ajuda.recuperacao.automatica=Recuperaci\u00F3n Autom\u00E1tica por C\u00F3digo
jcompany.cancelar=Cancelar
jcompany.controle.editar.chaveprimaria=La URL no est\u00E1 completa: falta el identificador para edici\u00F3n. Intente otra vez.
jcompany.erros=Error general desconocido. Comun\u00EDquese con el analista responsable. <br/> Mensaje del Sistema: {0}
jcompany.erros.abre.sessao=Error al intentar abrir sesi\u00F3n.<br/> Mensaje del Sistema: {0}
jcompany.erros.anteseditar=Error inesperado antes de la edici\u00F3n. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.antesgravar=Error inesperado antes de la escrita. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.aopesquisar.retornoinvalido=Error inesperado - Retorno inv\u00E1lido al intentar pesquisar. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.atributos.multivalorados=Error al intentar obtener atributos multi-valorados del Form-Bean: <br/> Mensaje del Sistema: {0}
jcompany.erros.cnpj=Este CNPJ no es v\u00E1lido.
jcompany.erros.coluna.nulo=Falt\u00F3 informar valor para un campo obligatorio <br/> Mensaje del Sistema: {0}
jcompany.erros.commit.chavenaoinformada=Identificador del registro no informado. <br/> Mensaje del Sistema: {0}
jcompany.erros.commit.concorrencia=Otro usuario modific\u00F3 el registro antes de usted. Recup\u00E9relo y haga otra vez la modificaci\u00F3n. <br/> Persistiendo el error, comun\u00EDquese con el analista responsable.<br/> Mensaje Original del Sistema: {0} 
jcompany.erros.commit.integridade=No es posible concluir a operaci\u00F3n. El registro es utilizado em otra tabla. <br/> Mensaje Interna: {0}
jcompany.erros.commit.naoachou=Registro no encontrado. Verifique argumentos e intente otra vez.
jcompany.erros.complementarvo.individual=Error inesperado al intentar complementar el Value Object {0}. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {1}
jcompany.erros.complementavo=Error inesperado al intentar complementar lista de Value Objects. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.cpf={0} no es v\u00E1lido.
jcompany.erros.criaClasseAgregada=Error inesperado al intentar criar clase agregada. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.debug.faltou.declarar.itens=Falt\u00F3 declarar un atributo con nombre '\u00EDtems' (ArrayList), no FormBean, para recibir resultados de pesquisas.
jcompany.erros.definicao.mestredetalhe=Error de definici\u00F3n de l\u00F3gica Maestro-Detalle para el portlet {0}. Comun\u00EDquese con el Analista Responsable.
JCOMPANY_ERROR_TABULAR_DUPLICITYntentar insertar registros duplicados. Irfomado plazo: {0}
jcompany.erros.evento=Requisici\u00F3n no sometida con direcci\u00F3n completa. Resubmeta-a por favor. <br/> Mensaje del Sistema: {0}
jcompany.erros.excluir=Error al intentar excluir el registro. {0}
jcompany.erros.falta.dirbaserel=jCompany Debug: Falta declarar el directorio base para reportes no web.xml.
jcompany.erros.falta.evento=Error inesperado al intentar interpretar el evento. Par\u00E1metro no encontrado.
jcompany.erros.fechar.sessao=Error al intentar cerrar sesi\u00F3n Hibernate. <br/> Mensaje del Sistema: {0}
jcompany.erros.geral=Excepci\u00F3n no esperada - Reporte al Analista Responsable\:{0} 
jcompany.erros.gerar.relatorio=Error inesperado al intentar generar reporte. <br/> Mensaje del Sistema: {0}
jcompany.erros.gravar=Error inesperado al intentar escribir dados. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.hibernate.duplicidade=Error no esperado al intentar testar duplicidad. <br/> Mensaje del Sistema: {0}
jcompany.erros.hibernate.geral=Error inesperado de la biblioteca de persistencia. Comun\u00EDquese con el Analista Responsable. <br/> Mensaje del Sistema: {0}
jcompany.erros.hibernate.inesperado=Error no esperado de tratamiento para escrita en la base de datos. Comun\u00EDquese con el Analista Responsable. <br/> Mensaje del sistema: {0}
jcompany.erros.hibernate.lista=Error no esperado de persistencia al intentar recuperar lista.<br/> Mensaje del Sistema: {0}
jcompany.erros.hibernate.update=Error de modificaci\u00F3n. <br/> Mensaje del Sistema: {0}
jcompany.erros.inclui=Error inesperado al intentar inicializar el formulario. <br/> Mensaje del Sistema: {0}
jcompany.erros.informar=Informar
jcompany.erros.inicializa.request=Error inesperado al intentar inicializar el request.  <br/> Mensaje del Sistema: {0}
jcompany.erros.inicializar.sessao=Error inesperado al iniciar sesi\u00F3n. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.linha.n=na linha {0}.
jcompany.erros.lista=Error al intentar recuperar listas {0}
jcompany.erros.long.valorfinanceiro={0} debe ser un valor num\u00E9rico v\u00E1lido, sin casas decimales.
jcompany.erros.mensagem.sistema=Mensaje original del sistema: {0}
jcompany.erros.monta.detalhes=Error inesperado al intentar montar detalles.<br/> Mensaje del Sistema: {0}
jcompany.erros.montaVOPersistencia=Error inesperado al intentar montar el VO de Persistencia. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.obtemVO=Error inesperado al intentar obtener el nombre del VO. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.obtemnomeVO=Error inesperado al intentar recuperar el Nombre del VO. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.obtemtipovo=Error inesperado al intentar obter el tipo del VO. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.alterar=Error no esperado al intentar modificar. <br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.anula.objetos=Error al intentar anular objetos.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.arq.alterar=Error al intentar alterar objeto {0} para archivo.<br/> Mensaje del Sistema: {1}
jcompany.erros.persistencia.arq.excluir=Error al intentar excluir objeto {0} para archivo.<br/> Mensaje del Sistema: {1}
jcompany.erros.persistencia.arq.incluir=Error al intentar incluir objeto {0} para archivo.<br/> Mensaje del Sistema: {1}
jcompany.erros.persistencia.arq.recuperar=Error al intentar recuperar objeto{0} de archivo.<br/> Mensaje del Sistema: {1}
jcompany.erros.persistencia.arq.recuperar.lista=Error al intentar recuper lista {0} de archivo.<br/> Mensaje del Sistema: {1}
jcompany.erros.persistencia.classe=Error no esperado al intentar criar el Value Object: {0}. Probablemente el package informado no est\u00E1 correcto. <br/> Mensaje del Sistema: {1}
jcompany.erros.persistencia.duplicidade=Error no esperado al intentar testar duplicidad. <br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.duplicidade.tabular=Declaraci\u00F3n de cl\u00E1usula "naoDeveExistir" inv\u00E1lida para l\u00F3gica. L\u00F3gicas tabulares validan duplicidades de la propiedad "nome".
jcompany.erros.persistencia.excluir=Error inesperado al intentar excluir.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.filtro.seguranca=Error no esperado al intentar aplicar filtro de seguranca "{1}".<br/> Mensaje del Sistema: {1}
jcompany.erros.persistencia.geral=Error inesperado al intentar escribir. Comun\u00EDquese con el Analista Responsable. <br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.getter=Error no esperado al intentar llamar m\u00E9todo Getter para Value Object. <br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.gravar=Error no esperado al intentar escribir.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.incluir=Error no esperado al intentar incluir.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.monta.clausula.orderby=Error al intentar montar la cl\u00E1usula orderby.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.monta.clausula.where=Error al intentar montar la cl\u00E1usula where.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.montarquery=Error no esperado al intentar montar la query din\u00E1mica. <br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.recuperar=Error no esperado al intentar recuperar.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.recuperar.classeagregada=Error al intentar recuperar clase agregada.
jcompany.erros.persistencia.recuperar.filtro=Usted no tiene autorizaci\u00F3n para recuperar este registro.
jcompany.erros.persistencia.recuperar.lista=Error no esperado al intentar recuperar lista.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.recuperar.lista.simples=Error al intentar recuperar lista simples para {0}. <br/> Mensaje del Sistema: {1}. Certif\u00EDquese de haber informado el path completo para nombre de clase. Ex: br.com.powerlogic.modelo.MinhaClasse
jcompany.erros.persistencia.recuperarObjeto=Error al intentar recuperar Objeto.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.recuperarlista=Error no esperado al intentar recuperar lista.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.rollback=Error inesperado al intentar hacer el  rollback.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.simulada.gerar.id=Error al intentar generar Id.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.simulada.recuperar.porchave=Error al intentar recuperar.<br/> Mensaje del Sistema: {0}
jcompany.erros.persistencia.trocanulo=Error al intentar cambiar cl\u00E1usula del atributo {0} para is null. <br/> Mensaje del Sistema: {1}
jcompany.erros.pesquisa=Error inesperado al intentar pesquisar. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.portlet.evento.nulo=Error inesperado tratando componente visual. El evento est\u00E1 nulo.
jcompany.erros.portlet.falta.id.ou.acao=Falta identificador del portlet o de la acci\u00F3n.
jcompany.erros.portlet.id.nulo=Error inesperado tratando componente visual. El identificador del componente est\u00E1 nulo.
jcompany.erros.portlet.tratacomponentevisual=Error inesperado tratando componente visual {0} en el evento {1}.<br/> Mensaje del Sistema: {2}
jcompany.erros.reconnect=Error inesperado al intentar reconectar la sesi\u00F3n.<br/> Mensaje del Sistema: {0}
jcompany.erros.recupera.nome.arquivo=Error al intentar recuperar nombre de archivo adjuntado. <br/> Mensaje del Sistema: {0}
jcompany.erros.recuperaLista=Error al intentar recuperar lista. Comun\u00EDquese con el Analista Responsable. <br/> Mensaje Interno: {0}
jcompany.erros.recuperaVO=Error inesperado al intentar recuperar el VO. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.recuperacao.perfilusuario=Error inesperado al intentar recuperar el Perfil del Usuario. Comun\u00EDquese con el Analista Responsable\:{0}
jcompany.erros.registro.persistencia=Error inesperado al intentar inicializar el servicio de Persistencia. Comun\u00EDquese con el Analista Responsable\:{0}.
jcompany.erros.remove.detalhes=Error no esperado al intentar remover \u00EDtems a excluir del form.<br/> Mensaje del Sistema: {0}
jcompany.erros.sql.chave.duplicada=Ya existe un registro con la llave informada. <br/> Mensaje del Sistema: {0}
jcompany.erros.sql.coluna.nula=Error no esperado de la base de datos. Un valor obligatorio no fue enviado.  <br/> Mensaje del Sistema: {0}
jcompany.erros.sql.geral=Error inesperado de SQL.<br/> Mensaje del Sistema: {0}
jcompany.erros.sql.inesperado=Error no esperado de base de datos. Comun\u00EDquese con el Analista Responsable. <br/> Mensaje del sistema: {0}
jcompany.erros.sql.lista=Error no esperado de base de datos al intentar recuperar lista.<br/> Mensaje del Sistema: {0}
jcompany.erros.transfereBeans=Error inesperado al intentar transferir dados. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.transfereBeansArg=Error inesperado al intentar transferir argumentos gen\u00E9ricamente. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0} 
jcompany.erros.trataOutrosEventos=Error inesperado al intentar tratar otros eventos. Comun\u00EDquese con el Analista Responsable: <br/> Mensaje del Sistema: {0}
jcompany.erros.valida.detalhes=Error al intentar validar detalles. <br/> Mensaje del Sistema: {0}
jcompany.erros.valor.muito.grande=Uno de los valores informados es muy grande para el tama\u00F1o reservado en la base de datos.<br/> Mensaje del Sistema: {0}
jcompany.evt.portlet.mais=+
jcompany.evt.portlet.menos=-
jcompany.evt.x=x
jcompany.evt.y=y
jcompany.fabrica.inicializar=Error al intentar inicializar la f\u00E1brica de conex\u00F5es de persistencia.
jcompany.form.ajax=Ajax
jcompany.hql.interativo=HQL Interactivo
jcompany.layout.portalclassico=Portal Cl\u00E1sico
jcompany.layout.portalclassicoreduzido=Portal Cl\u00E1sico Reducido
jcompany.layout.quiosque=Exposici\u00F3n (antalla: Men\u00FA)
jcompany.layout.quiosquecorpo=Exposici\u00F3n (Pantalla: Cuerpo)
jcompany.layout.sistemacorporativo=Sistema Corporativo
jcompany.layout.sistemacorporativoreduzido=Reducci\u00F3n del Sistema Corporativo
jcompany.lingua.espanhol=Versi\u00F3n Espa\u00F1ola
jcompany.lingua.frances=Version Fran\u00E7aise
jcompany.lingua.ingles=English Version
jcompany.lingua.portugues=Vers\u00E3o em Portugu\u00EAs
jcompany.linha.detalhe.invalida=Para FormBeans de detalle, debe declararse un atributo con nombre "linhaPlc", para contener el n\u00FAmero de l\u00EDnea para ser validada. Form-Bean: {0}
jcompany.msg.verifica.alteracao=Existem modifica\u00E7\u00F5es pendentes neste formul\u00E1rio. Tem certeza de que deseja prosseguir sem salv\u00E1-las?
jcompany.nav.ate=hasta
jcompany.nav.de=desde
jcompany.nav.total=total:
jcompany.nome.deve.ser.informado=Nombre debe ser informado.
jcompany.opcoes.rel.enviar.email=Enviar para e-mail despu\u00E9s de la execuci\u00F3n\:
jcompany.opcoes.rel.formato=Formato Deseado
jcompany.opcoes.rel.html=HTML
jcompany.opcoes.rel.imediato=Inmediato
jcompany.opcoes.rel.mod.baixar=Baixar Ap\u00F3s Execuci\u00F3n<br/>(Solo Inmediato)
jcompany.opcoes.rel.mod.salvar=Salvar Para Visualizar Posteriormente (Para Reportes Grandes)
jcompany.opcoes.rel.modalidade=Modalidad de Ejecuci\u00F3n
jcompany.opcoes.rel.pdf=Adobe PDF
jcompany.opcoes.rel.programado=Programado para (dd/mm/aaaa hh\:mm)
jcompany.opcoes.rel.publico=P\u00FAblico
jcompany.opcoes.rel.quando=Cuando Ejecutar?
jcompany.opcoes.rel.titulo=Opciones de Ejecuci\u00F3n de Reportes
jcompany.opcoes.rel.xls=Hoja Excel
jcompany.opcoes.rel.xml=XML
jcompany.pele.azul=Azul
jcompany.pele.brasil=Brasil
jcompany.pele.moeda=Moneda
jcompany.pele.itunes=Itunes
jcompany.pele.pergaminho=Pergamino
jcompany.pele.terra=Tierra
jcompany.pele.oceano=Océano
jcompany.pele.preto_branco=Blanco y Negro
personalizarFormPlc.titulo=Estilo Personalizado Formulario
personalizarFormPlc.tituloP=Formulario personalizado
personalizarlayoutplc.titulo=Personalizar el diseño
personalizarpeleplc.titulo=Personalizar Skin
jcompany.estilo.barra.acoes=Estilo Barra de acción
jcompany.layout.sistema=Sistema
jcompany.layout.sistema_reduzido=Reducci\u00F3n del Sistema
jcompany.pers.form=Cambiar Form
jcompany.pers.layout=Cambiar Layout
jcompany.pers.pele=Cambiar Piel (Colores y Fonts)
jcompany.rodape.copyright=Copyright 2010/2013
jcompany.tabular.faltou.detalhe=Para l\u00F3gica tabular, el Form-Bean debe contener un atributo del tipo "java.util.ArrayList".
jcompany.tipo.detalhe.invalido=L\u00EDneas de detalle deben de utilizar como tipo "java.util.ArrayList": {0}
jcompany.titulos.personaliza.form=Personalizaci\u00F3n de Form
jcompany.titulos.personaliza.layout=Personalizaci\u00F3n de Layout
jcompany.titulos.personaliza.pele=Personalizaci\u00F3n de Piel
jcompany.trocarlayout.titulo=Escoja el layout deseado y cambie la apariencia de su aplicaci\u00F3n
jcompany.trocarpele.titulo=Escoja la piel deseada
jcompany.layout.classico=Portal Clásico
jcompany.layout.classico.dinamico=compacto
jcompany.layout.classico.dinamico.reduzido=Reducción Pacto
jcompany.layout.classico_dinamico=dinámica clásica
jcompany.layout.classico_dinamico_reduzido=Reducción Dinámica clásica
jcompany.layout.classico_reduzido=Portal clásico reducido
jcompany.layout.classicoexp=Dinámica clásica
jcompany.layout.classicoexpreduzido=Reducción Dinámica clásica
jcompany.layout.oriental=Oriental
jcompany.layout.oriental.dinamico=Oriental Pacto
jcompany.layout.oriental.dinamico.reduzido=Reducci\u00F3n Este Compacto 
jcompany.layout.oriental_dinamico=Este din\u00E1mico 
jcompany.layout.oriental_dinamico_reduzido=Din\u00E1mico Reducido Oriental 
jcompany.layout.oriental_reduzido=Reducci\u00F3n Oriental 
jcompany.layout.orientalreduzido=Reducci\u00F3n Oriental 
label.arquivo.arquivo.anexado=Archivo Adjuntado
label.arquivo.localizar=Seleccione el Archivo para Adjuntar 
label.arquivo.passo3.baixar=Haga click para Visualizar Archivo
label.auditoria.em=En\:
label.auditoria.ult.alteracao=\u00DAltima modificaci\u00F3n por\:
label.auditoria.versao=Versi\u00F3n\:
label.bemvindo=Bien Venido
label.cnpj=CNPJ
label.codigo=C\u00F3digo
label.cpf=CPF
label.data=Fecha
label.data.fim.ddmmaaaa=Fecha Fin (dd/mm/aaaa)
label.data.fim.mmaaaa=Fecha Fin (mm/aaaa)
label.data.inicio.ddmmaaaa=Fecha Inicio (dd/mm/aaaa)
label.data.inicio.mmaaaa=Fecha Inicio (mm/aaaa)
label.descricao=Descripci\u00F3n
label.email.composto=Informe uno ou m\u00E1s e-mails v\u00E1lidos, separados por punto y coma.
label.excluir=Excluir
label.horario=Horario
label.id=Id
label.nome=Nombre
label.obs=Observaci\u00F3n
label.seja.bem.vindo=Bienvenido, 
label.sigla=Sigla
label.situacao=Situaci\u00F3n
personalizarLayoutPlc.titulo=Layout
personalizarPelePlc.titulo=Piel
jcompany.m.ajuda=Ayuda
jcompany.m.area.tecnica=Área Técnica
jcompany.m.debates=Discusión
jcompany.m.faq=FAQ
jcompany.m.log.dinamico=Gestión de Registros
jcompany.m.personalizar=Preferencias / Idioma
jcompany.m.sobre=Sobre
jcompany.m.suporte=Support
jcompany.m.topicos=Tópicos
jcompany.label.esquema.arquivo= Generar en el Archivo
jcompany.label.esquema.arquivo.gerado=Archivo de creación
jcompany.label.esquema.conteudo=Esquema
ajuda.esquema=Esquema
jcompany.label.esquema.delimitador=Delimitador
jcompany.label.esquema.objetos=Generar sólo:
jcompany.label.esquema.owner=Propietario
jcompany.label.esquema.tipo=Tipo de esquema:
jcompany.ajuda.esquema.delimitador=delimitador para el contorno script
jcompany.ajuda.esquema.script=Esquema planteado Banco
jcompany.ajuda.esquema.owner=Propietario
jcompany.ajuda.esquema.arquivo=Nombre del archivo generado



#keys cal10n
JCOMPANY_ERROR_EVENT_NOT_HANDLEDError inesperado no se manejan adecuadamente. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_PERSISTENCE_FIND inesperado al intentar recuperar \nMensaje del Sistema: {0}
JCOMPANY_ERROR_PERSISTENCE_INSERTrror inesperado al intentar. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_PERSISTENCE_UPDATError inesperado al intentar cambiar. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_PERSISTENCE_DELETError inesperado al intentar eliminar. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_PERSISTENCE_DUPLICITYror inesperado al intentar poner a prueba la duplicidad. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_PERSISTENCE_SAVEror inesperado al intentar guardar. \nMensaje del sistema: {0}
JCOMPANY_ERROR_PERSISTENCE_CHANGE_NULLL=Error al intentar cambiar la cl\u00E1usula de atributo {0} a nulo. \nMensaje del Sistema: {1}
JCOMPAJCOMPANY_ERROR_PERSISTENCE_FINDES=Error al intentar recuperar la simple lista a {0}. \nMensaje del Sistema: {1}. Aseg\u00FArese de informar a la ruta de acceso completa al nombre de clase. Ex: br.com.powerlogic.modelo.MinhaClasse
JCOMPANY_ERRJCOMPANY_ERROR_PERSISTENCE_FINDerado error interno. Error al intentar recuperar la consulta entre los que elegir: {0}
JCOMPANY_ERROR_PERJCOMPANY_ERROR_PERSISTENCE_FIND recuperar los objetos. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_PERSISTENCE_DOWNLOADError inesperado al intentar descargar el fichero. \nError interno: {0}
JCOMPANY_ERROR_PERSISTENCE_GETTERError inesperado al intentar llamar al m\u00E9todo getter para el valor del objeto. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_COMPLEMENT_VO_INDIVIDUALError inesperado al intentar complementar el valor de objeto {0}. Comunicarse con el Analista Jefe. \nMensaje del Sistema: {1}
JCOMPANY_ERROR_SQL_LISTError inesperado base de datos de error al intentar recuperar la lista. \nMensaje del Sistema: {0} 
JCOMPANY_ERROR_HIBERNATE_LISTError inesperado al intentar recuperar la lista persistente. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_HIBERNATE_UPDATE = Error al modificar. \nMensaje del Sistema: {0}  
JCOMPANY_ERROR_REPLECTIONON=Error al intentar ejecutar el m\u00E9todo {1} para el objeto de clase {0} con argumentos : {2}. \nMensaje del Sistema: No puede encontrar el m\u00E9todo con este nombre en la clase.
JCOMPANY_ERROR_REPLECTION_GENERALERAL=Error al intentar ejecutar el m\u00E9todo {1} para el objeto de clase {0} con argumentos: {2}. Mensaje del Sistema: {3} 
JCOMPANY_ERROR_LOAD_FILEal intentar recuperar el archivo {0}. Interior mensaje: {1} 
JCOMPANY_ERROR_EVENTError inesperado. Comunicarse con el analista responsable.\nMensaje del sistema: {0}
JCOMPANY_ERROR_TRANSFER_BEANS=Error inesperado al intentar transferir datos. Comunicarse con el Analista Jefe. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_INSERT=Error inesperado al intentar inicializar el formulario. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_SCHEMA_CREATE_DIRECTORYY=Error al crear el directorio para el esquema de generaci\u00F3n de archivos. \n{0}
JCOMPANY_ERROR_SCHEMA_CREATE_FILError al crear el archivo para la generaci\u00F3n de esquemas. \n{0}
JCOMPANY_ERROR_ITEM_NOT_FOUNDede recuperar un registro con identificador {0}. Posiblemente debido a las restricciones de seguridad de la aplicación o porque se ha eliminado hace un tiempo.
JCOMPANY_ERROR_SCHEMA_TYPE=Informar el tipo de diseño que se cree
JCOMPANY_ERROR_VALIDATION_BETWEEN_FIELDS_NOT_VALIDALID=Error interno al intentar validar los valores entre {0} y {1}. Comunicar al responsable.
JCOMPANY_ERROR_COLUMN_DESPISESe produjo un error al intentar obtener el valor de la bandera columna utilizada por desacato de filas con el nombre de "{0}" para el detalle "{1}". Error: {2}
JCOMPANY_INVALID_DATEFecha no v\u00E1lida  {0} {1} 
JCOMPANY_ERROR_QUERY_DEFAULT_NOT_ANNOTATEDED=Error al intentar ejecutar el patrón de búsqueda. No se pudo encontrar ninguna anotación del patrón de consulta para la clase principal {0}
JCOMPANY_ERROR_DEPENDENCY_INJECTIONN=Intento de crear una instancia de campo de la clase con más los fabricantes que lo permitido. La clase {0} sólo debe tener un constructor, recibiendo sus dependencias
JCOMPANY_ERROR_NAMED_QUERY_NOT_FOUNDe puede encontrar la notaci\u00F3n de petici\u00F3n "@ NamedQuery" para apiQuerySel "{1}" en "{0}"   
JCOMPANY_ERROR_INVALID_IDENTITY inesperado de identificador no v\u00E1lido. valor identificador: {0} 
JCOMPANY_ERROR_ORIGEM_ATTRIBUTEonfiguraci\u00F3n. No pude conseguir una propiedad a la fuente de navegaci\u00F3n para la clase {0} 
JCOMPANY_ERROR_RETRIEVE_FILE_CONTENTrror de archivo de recuperaci\u00F3n de {0} 
JCOMPANY_ERROR_QUERYSEL_LOOKUPUP=Selección de consultas de búsqueda de la clase {0} no válido. Debe haber un signo de interrogación (?) o el identificador de parámetro.
JCOMPANY_ERROR_LOOKUP_NAMED_QUERY_NOT_FOUND=No se puede encontrar la notaci\u00F3n de petici\u00F3n "@ NamedQuery" querySelLookup para el "{0}" 
JCOMPANY_APPLICATION_NO_SIMILARo debe haber {0} duplicado 
JCOMPANY_ERROR_DEPENDENCY_INJECTION_INVALID_DAOO=Intento de crear una instancia de la clase DAO no válida "{0}". Clase debe ser un VO o su propio DAO
JCOMPANY_ERROR_DEPENDENCY_INJECTION_INVALID_REPOSITORYEPOSITORY=Intento de crear una instancia de BO de clase de la clase no válida "{0}".
JCOMPANY_ERROR_PERSISTENCE_DUPLICATED_ID=Error al guardar el registro. No se permite escribir documentos con identificadores iguales. 
JCOMPANY_ERROR_DELETE_KEY_NULLse puede eliminar porque la clave del Registro no es consciente: {0} 
JCOMPANY_ERROR_MASTERDETAIL_DUPLICITY est\u00E1 permitido incluir dos identificadores con los mismos detalles. {1} 
JCOMPANY_ERROR_FIND_CLASS_ON_DEMANDal intentar obtener los detalles de clase marcados para su uso en la demanda. No cree la clase para la propiedad "{0}"
JCOMPANY_ERROR_INVALIDATING_ITEMSu00F3gica {0} no es una l\u00F3gica con una lista de elementos 
JCOMPANY_ERROR_OBJECT_INSTANCE=Error al crear el objeto {0}
JCOMPANY_ERROR_CONFIGDETAIL_NOT_FOUNDlle no estaba configurado para utilizar el caso con el nombre: {0}
JCOMPANY_ERROR_FIND_AGGREGATE_OID_NOT_NUMERICIntroduzca un número válido para recuperar esta referencia
JCOMPANY_ERROR_FILE_DOWNLOAD_FILE_NOT_DEFINED ha producido un error en la descarga. La definición del archivo adjunto no se ha encontrado.
JCOMPANY_ERROR_CONFIG_NULLULL=La configuración de fábrica del banco de datos no se encontró.
JCOMPANY_ERROR_HQL_WITHOUT_FROM_FROM=Una cláusula FROM no fue encontrada.
JCOMPANY_ERROR_PERSISTENJCOMPANY_ERROR_PERSISTENCE_FINDobtener este registro.
JCOMPANY_ERROR_SCHEMA_EXECUTE=Error en la ejecuci\u00F3n del esquema de base de datos.\nMensaje del Sistema: {0}
JCOMPANY_ERROR_APPROVE=Error al intentar aprobar o desaprobar. El registro no puede estar en posici\u00F3n de espera o Inactivo. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_AGGREGATE_LOOKUP_ONLY_OIDOID=Esta versión, el acceso automatizado a las clases de agregados sólo está disponible con los identificadores de objetos-Id.
JCOMPANY_ERROR_NOT_CURRENT_PORTLETPortlet no se perciban por la actual expansión / contracción. Comuníquese con la persona responsable de la ejecución.
JCOMPANY_ERROR_DUPLICATED_MULTIPLE_FILEScluir archivos con nombres que coincidan
JCOMPANY_ERROR_CLASS_FILES=Error al establecer el archivo adjunto al cuerpo. Check 'fileAttach' la propiedad, declar\u00F3 en la anotaci\u00F3n @PlcConfigAggregation en el Managed Bean. 
JCOMPANY_ERROR_MAXIMUM_MULTIPLE_FILESro máximo de archivos adjuntos se ha alcanzado
JCOMPANY_ERROR_ATTACHED_FILE_ATTRIBUTEboraci\u00F3n define el uso de Archivo tipo {0} pero no hay una declaraci\u00F3n de atributo 'idArquivoAnexadoPlc' en la entidad {1}.\nError original: {2}
JCOMPANY_ERROR_DATE_RANGEno al intentar validar rango de fechas. Consulte con el responsable
JCOMPANY_ERROR_SAVE_VO_NULLror interno. El Entity es nulo en el momento de la grabación
JCOMPANY_ERROR_COLUMN_NULL=Informe carece de un valor necesario para {0}
JCOMPANY_ERROR_COMMIT_INTEGRITYo se puede completar la operación. El registro se utiliza en otra tabla. {0}
JCOMPANY_ERROR_VALUE_TOO_LONG de los valores reportados es demasiado grande para el tamaño reservado en la base de datos. {0}
JCOMPANY_ERROR_SQL_DUPLICATED_KEYYa existe un registro con una clave dada. \nMensaje del Sistema: {0}
JCOMPANY_ERROR_SQL_COLUMN_NULL=Error inesperado de la base de datos. Un valor requerido no se ha enviado. {0}
JCJCOMPANY_ERROR_PERSISTENCE_DELETESTRAINT=Error al intentar objeto de referencia. Algunos de referencia que se incluye no se puede encontrar en la base de datos, o algún objeto que se ha eliminado las referencias apuntan a que en la base de datos. Compruebe los valores reportados y vuelva a enviar. Si el problema persiste, póngase en contacto a la persona responsable de la aplicación {0}
JCOMPANY_ERROR_SUPERIOR_HIERARCHY_NOT_FOUNDgistro no existe en la jerarqu\u00EDa superior. {0}  
JCOMPANY_ERROR_SQL_UNEXPECTED=base de datos de error inesperado. Comunicarse con el analista responsable. {0}
JCOMPANY_ERROR_COMMIT_CONCURRENCYOtro usuario ha cambiado el registro antes de grabar o identificador (PK) ha sido alterado. Recuperar de nuevo y volver a presentar la enmienda. Recordando que la (s) palanca (s) no puede (m) se ha cambiado (s). \nEl error persiste, por favor informe al analista responsable. {0}
JCOMPANY_ERROR_ATTRIBUTE_NULL_NOT_FILLED0} es necesario {1} {2} 
JCOMPANY_ERROR_COMMIT_NOT_FOUNDD=Registro no encontrado. Echa un vistazo a los argumentos y vuelva a intentarlo.
JCOMPANY_ERROR_COMMIT_KEY_NOT_FILLED identificador del registro no fue informado. \nMensaje del Sistema: {0}     


MSG_SAVE_SUCCESSLUSAO_ARQUIVOS_SUCESSO=El archivo se ha eliminado correctamente
MSG_MSG_SAVE_SUCCESSo guardado con éxito
MSG_SAVEMSG_SAVE_SUCCESSTALHE_SUCESSO=Registro guardado con éxito. Detalles y / o Subdetail fueron excluidos.
MSG_DELETE_SUCCESSegistro eliminado correctamente
MSG_CLONE_SUCCESS clonación con éxito. Cambie la información y presentar la grabación para crear un nuevo registro.
ERRORS_REQUIRED={0} se requiere
JCOMPANY_ERROR_GENERIC=Error inesperado en el m\u00E9todo "{0} ". \nMensaje original del sistema: {1}
ERRORS_BYTE={0} debe ser de tipo byte.
ERRORS_CREDITCARD={0} no es una tarjeta de crédito válida.
ERRORS_DATE={0} no es una fecha válida.
ERRORS_DOUBLE={0} debe ser un número decimal.
ERRORS_EMAIL={0} no es una dirección de correo electrónico.
ERRORS_FLOAT={0} debe ser un número de punto flotante (tipo float).
ERRORS_INTEGER={0} debe ser un número entero (de tipo Integer).
ERRORS_INVALID={0} no es válido
ERRORS_LONG={0} debe ser un número largo (de tipo Long).
ERRORS_MAXLENGTH={0} no puede tener más de {1} caracteres
ERRORS_MINLENGTH={0} nno puede ser inferior a los {1} caracteres 
ERRORS_RANGE={0} debe estar en el rango {1} a {2}.
ERRORS_SHORT={0} debe ser de tipo short.
MSG_KEY_NOT_FOUNDla de mensajes que no se encuentra
JCOMPANY_ERROR_FILE_INVALID_LENGTH=El tamaño del archivo es mayor que el límite de {0} permitido
JCOMPANY_SCHEMA_SCRIPT_STARTUP=La generación del esquema se encuentra en modo de startup
JCOMPANY_WARNING_SEL_NOT_FOUND=Hay registro cumple los criterios informó que se encuentran!
JCOMPANY_MASTERDETAIL_MULTIPLICITY_MAXtiplo minimo es de {0} sub-detalle (s)
JCOMPANY_ERROR_LOGIN_FIELD_NOT_FOUNDD=A propriedade {0} definida como chave de preferência de usuário não foi encontrada!
JCOMPANY_ERROR_AMBIGUOUS_CONTROLLER=La ambig\u00FCedad en los controles, hay m\u00E1s de un control que sirven el mismo recurso: {0} e {1}\!
JCOMPANY_ERROR_AMBIGUOUS_CONVERSOR=La ambig\u00FCedad de los transformadores, hay m\u00E1s de un convertidor que cumple con el mismo tipo: {0} e {1}\!
JCOMPANY_SCHEMA_SCRIPT_SUCCESS=DDL generado con éxito
JCOMPANY_SCHEMA_UPDATE_SUCCESS=Régimen de actualización generado con éxito.
JCOMPANY_ERROR_SEARCH_METHOD_NOT_FOUND=Error al buscar por el método de la jerarquía. Método que no se encuentra.

# ValidationMessages
javax.validation.constraints.AssertFalse.message=debe ser falsa
javax.validation.constraints.AssertTrue.message=debe ser cierto
javax.validation.constraints.DecimalMax.message=debe ser menor o igual a {value}
javax.validation.constraints.DecimalMin.message=debe ser mayor o igual a {value}
javax.validation.constraints.Digits.message=a valor numérico de los límites (<{integer} dígitos>.<{fraction} dígitos> se espera)
javax.validation.constraints.Future.message=debe ser en el futuro
javax.validation.constraints.Max.message=debe ser menor o igual a {value}
javax.validation.constraints.Min.message=debe ser mayor o igual a {value}
javax.validation.constraints.NotNull.message=no puede ser nulo
javax.validation.constraints.Null.message=puede ser nulo
javax.validation.constraints.Past.message=debe ser en el pasado
javax.validation.constraints.Pattern.message=debe coincidir con "{regexp}"
javax.validation.constraints.Size.message=debe estar entre {min} y {max}
org.hibernate.validator.constraints.Email.message=no es una dirección de correo electrónico
org.hibernate.validator.constraints.Length.message=debe estar entre {min} y {max}
org.hibernate.validator.constraints.NotBlank.message=no puede estar vacío
org.hibernate.validator.constraints.NotEmpty.message=no puede estar vacío
org.hibernate.validator.constraints.Range.message=debe estar entre {min} y {max}
org.hibernate.validator.constraints.URL.message=debe ser una URL válida
org.hibernate.validator.constraints.CreditCardNumber.message=número de tarjeta de crédito válida
